app/controllers/candidate_controller.rb

SELECT "candidates".* FROM "candidates"
---
  def index
    @candidate_list = Candidate.all

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = 13 LIMIT 1
---
  def show
    @candidate = Candidate.find_by(:id => params[:candidate_id])

INSERT INTO "candidates" ("company", "created_at", "role", "updated_at") VALUES (?, ?, ?, ?)  [["company", "Microsoft"], ["created_at", Fri, 07 Mar 2014 16:59:57 UTC +00:00], ["role", "Social Media Manager"], ["updated_at", Fri, 07 Mar 2014 16:59:57 UTC +00:00]]
---
  def create
    resume = Candidate.new
    resume.name = params["name"]
    resume.photo_url = params["photo_url"]
    resume.company = params["company"]
    resume.role = params["role"]
    resume.city = params["city"]
    resume.save

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = 4 LIMIT 1
DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 4]]
---
  def destroy
    candidate = Candidate.find_by(:id => params[:candidate_id])
    candidate.destroy

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = 0 LIMIT 1
---
  def edit
    @candidate = Candidate.find_by(:id => params[:candidate_id])

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" IS NULL LIMIT 1
UPDATE "candidates" SET "name" = ?, "photo_url" = ?, "company" = ?, "role" = ?, "city" = ?, "updated_at" = ? WHERE "candidates"."id" = 3  [["name", nil], ["photo_url", nil], ["company", nil], ["role", nil], ["city", nil], ["updated_at", Mon, 10 Mar 2014 16:02:42 UTC +00:00]]
---
  def update
    cand = Candidate.find_by(:id => params[:candidate_id])
    cand.name = params["name"]
    cand.photo_url = params["photo_url"]
    cand.company = params["company"]
    cand.role = params["role"]
    cand.city = params["city"]
    cand.save