app/controllers/users_controller.rb

  def show
    @user = User.find_by(:id => params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1